misc/learning_abstract_algebra-2022-05-21-16-55.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-12 Sun 23:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>learning<sub>abstract</sub><sub>algebra</sub></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alexander Comerford" />
</head>
<body>
<div id="content">
<h1 class="title">learning<sub>abstract</sub><sub>algebra</sub></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7d2172">1. Homework #1</a></li>
</ul>
</div>
</div>
<p>
I am currently learning abstract algebra through a tutor after realizing how in
over my head I was learning elliptic curve pairings. On an abstract level the
concept of billinear maps (which are the desired result produced by elliptic
curve pairings) I can understand, but wawaweewa the underlying mechanisms are
NOT SIMPLE.
</p>

<p>
I thought I understood a lot of the fundamentals of elliptic curves, but in
order to understand &ldquo;pairings&rdquo; you need almost an order of magnitude more
knowledge of elliptic curves to do so.
</p>

<p>
In order to grow my mathematical foundation I&rsquo;m leveraging the help of a tutor
to help me smooth over the gaps of my knowledge.
</p>

<p>
I am starting with undergrad content in abstract algebra here:
</p>

<p>
<a href="https://www.math.miami.edu/~armstrong/562sp22/562sp22notes.pdf">https://www.math.miami.edu/~armstrong/562sp22/562sp22notes.pdf</a>
</p>

<p>
My primary goal is to be able to retain and use this knowledge as a stepping
stone for further complicated topics. To achieve this I&rsquo;ll be taking digestible
pieces from the source material and produce a few blog post (maybe about the
proofs).
</p>

<div id="outline-container-orga7d2172" class="outline-2">
<h2 id="orga7d2172"><span class="section-number-2">1.</span> Homework #1</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FA1B3;">(</span><span style="color: #b48ead;">setq</span> org-babel-python-command <span style="color: #c678dd;">(</span>format <span style="color: #A3BE8C;">"%s/sympy"</span> <span style="color: #A3BE8C;">(</span>getenv <span style="color: #A3BE8C;">"SCRIPTS"</span><span style="color: #A3BE8C;">)</span><span style="color: #c678dd;">)</span><span style="color: #8FA1B3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b48ead;">import</span> multiprocessing.pool
<span style="color: #b48ead;">import</span> functools

<span style="color: #b48ead;">def</span> <span style="color: #8FA1B3;">timeout</span>(max_timeout):
    <span style="color: #8b969e;">"""Timeout decorator, parameter in seconds."""</span>
    <span style="color: #b48ead;">def</span> <span style="color: #8FA1B3;">timeout_decorator</span>(item):
        <span style="color: #8b969e;">"""Wrap the original function."""</span>
        <span style="color: #b48ead;">@functools.wraps</span>(item)
        <span style="color: #b48ead;">def</span> <span style="color: #8FA1B3;">func_wrapper</span>(*args, **kwargs):
            <span style="color: #8b969e;">"""Closure for function."""</span>
            <span style="color: #BF616A;">pool</span> = multiprocessing.pool.ThreadPool(processes=1)
            <span style="color: #BF616A;">async_result</span> = pool.apply_async(item, args, kwargs)
            <span style="color: #65737E;"># </span><span style="color: #65737E;">raises a TimeoutError if execution exceeds max_timeout</span>
            <span style="color: #b48ead;">return</span> async_result.get(max_timeout)
        <span style="color: #b48ead;">return</span> func_wrapper
    <span style="color: #b48ead;">return</span> timeout_decorator
</pre>
</div>

<p>
Question 1:
</p>

<p>
Write a computer program to compute the order of a mod n, i.e., the smallest
r&gt;=1 such that a<sup>r</sup> = 1 mod n.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b48ead;">@timeout</span>(10.0)
<span style="color: #b48ead;">def</span> <span style="color: #8FA1B3;">find_order_naive</span>(a, n):
    <span style="color: #8b969e;">'''</span>
<span style="color: #8b969e;">    solves for r:</span>
<span style="color: #8b969e;">    a^r = 1 mod n</span>
<span style="color: #8b969e;">    '''</span>
    <span style="color: #BF616A;">r</span> = 1
    <span style="color: #b48ead;">while</span> <span style="color: #D08770;">pow</span>(a, r, n) != <span style="color: #BF616A;">1</span>:
        <span style="color: #BF616A;">r</span> += 1
    <span style="color: #b48ead;">return</span> r

print(find_order_naive(10, 17))
</pre>
</div>

<pre class="example">
16
</pre>


<p>
Question 2:
</p>

<p>
Use your program to find the order of every element of (Z/13Z)<sup>X</sup>. Since
phi(13)=12 we know from Euler&rsquo;s totient theorem that the order of every
element of (Z/13)<sup>X</sup> has order that divides 12.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BF616A;">ring_size</span> = 13
<span style="color: #BF616A;">results</span> = [[<span style="color: #A3BE8C;">"Element"</span>, <span style="color: #A3BE8C;">"Order"</span>, <span style="color: #A3BE8C;">"Div{ring_size-1}"</span>]]
<span style="color: #b48ead;">for</span> elem <span style="color: #b48ead;">in</span> <span style="color: #D08770;">range</span>(2, ring_size):
    <span style="color: #BF616A;">order</span> = find_order_naive(elem, ring_size)
    results.append(
        [
         elem,
         order,
         (ring_size-1) % order == 0
         ]
  )
results
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Element</td>
<td class="org-right">Order</td>
<td class="org-left">Div{ring<sub>size</sub>-1}</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">12</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">12</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">12</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">4</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">3</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">6</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">12</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">2</td>
<td class="org-left">True</td>
</tr>
</tbody>
</table>

<p>
Compute phi(d) for every divisor of 12, i.e., for d=1, 2, 3, 4, 6, 12.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b48ead;">from</span> sympy <span style="color: #b48ead;">import</span> divisors
<span style="color: #b48ead;">from</span> sympy.ntheory <span style="color: #b48ead;">import</span> factorint, divisors

<span style="color: #b48ead;">def</span> <span style="color: #8FA1B3;">totient</span>(n):
    <span style="color: #BF616A;">prime_factors</span> = factorint(n, limit=10000)
    <span style="color: #BF616A;">ans</span> = n
    <span style="color: #b48ead;">for</span> p <span style="color: #b48ead;">in</span> prime_factors.keys():
        <span style="color: #BF616A;">ans</span> *= 1 - (1/p)
    <span style="color: #b48ead;">return</span> ans

<span style="color: #b48ead;">for</span> d <span style="color: #b48ead;">in</span> divisors(12):
    print(totient(d))

</pre>
</div>

<pre class="example">
1
1.0
2.0
2.0
2.0
4.0
</pre>


<p>
Observe that the number of elements of (Z/13Z)<sup>X</sup> of order d equals phi(d). In
particular, observe that there are phi(12) elements of order 12. These are the
&ldquo;generators&rdquo; of (Z/13)<sup>X</sup>.
</p>

<p>
We will prove later that the same ideas hold for (Z/pZ)<sup>X</sup> whenever p is prime.
</p>
</div>
</div>
</div>
</body>
</html>
